import fs from "fs";

const names = `ഉല്‍‍പത്തി
പുറപ്പാട്
ലേവ്യര്‍
സംഖ്യ
നിയമാവര്‍ത്തനം
ജോഷ്വാ
ന്യായാധിപ‌ന്‍‍മാര്‍
റൂത്ത്
1 സാമുവല്‍
2 സാമുവല്‍
1 രാജാക്ക‌ന്‍‍മാര്‍
2 രാജാക്ക‌ന്‍‍മാര്‍
1 ദിനവൃത്താന്തം
2 ദിനവൃത്താന്തം
എസ്രാ
നെഹമിയ
തോബിത്
യൂദിത്ത്
എസ്തേര്‍
1 മക്കബായര്‍
2 മക്കബായര്‍
ജോബ് 
സങ്കീര്‍ത്തനങ്ങള്‍
സുഭാഷിതങ്ങള്‍
സഭാപ്രസംഗക‌ന്‍
ഉത്തമഗീതം
ജ്ഞാനം
പ്രഭാഷക‌ന്‍
ഏശയ്യാ
ജെറെമിയ
വിലാപങ്ങള്‍
ബാറൂക്ക്
എസെക്കിയേല്‍
ദാനിയേല്‍
ഹോസിയാ
ജോയേല്‍
ആമോസ്
ഒബാദിയ
യോനാ 
മിക്കാ
നാഹും
ഹബക്കുക്ക്
സെഫാനിയ
ഹഗ്ഗായി
സഖറിയാ
മലാക്കി
മത്തായി
മര്‍ക്കോസ്
ലൂക്കാ
യോഹന്നാ‌ന്‍
അപ്പ. പ്രവര്‍ത്തനങ്ങള്‍
റോമാ 
1 കൊറിന്തോസ്
2 കൊറിന്തോസ്
ഗലാത്തിയാ
എഫേസോസ്
ഫിലിപ്പി
കൊളോസോസ്
1 തെസലോനിക്കാ
2 തെസലോനിക്കാ
1 തിമോത്തേയോസ്
2 തിമോത്തേയോസ്
തീത്തോസ്
ഫിലെമോ‌ന്‍
ഹെബ്രായര്‍
യാക്കോബ്
1 പത്രോസ്
2 പത്രോസ്
1 യോഹന്നാ‌ന്‍
2 യോഹന്നാ‌ന്‍
3 യോഹന്നാ‌ന്‍
യുദാസ്
വെളിപാട്`;

const nameList = names.split("\n");

const books = JSON.parse(fs.readFileSync("merged.json", { encoding: "utf-8" }));

console.log(books.length);

for (let i = 0; i < 73; i++) {
    books[i].name = nameList[i];
}

fs.writeFileSync("merged.json", JSON.stringify(books, null, 2));